c5/src/Documents/Shipment/Shipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Shipment</name>
  <posting>Deny</posting>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>SO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>CapacityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>PackagePlan</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Picked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/InformationRegisters/ShipmentStatuses/ShipmentStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ShipmentStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.ShipmentPoints</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Shipment</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/ShipmentPoints/ShipmentPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ShipmentPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Picking</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Shipment/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Base;
var Env;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkQuantityBack () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkQuantityBack ()
	
	error = false;
	column = ? ( Options.Packages (), "QuantityPkg", "Quantity" );
	for each row in Items do
		if ( row.QuantityBack < 0 ) then
			Output.QuantityBackIncorrect ( , Output.Row ( "Items", row.LineNumber, column ) );
			error = true;
		endif; 
	enddo; 
	return not error;

EndFunction 

Procedure Filling ( FillingData, StandardProcessing )
	
	Base = FillingData;
	baseType = TypeOf ( Base );
	if ( baseType = Type ( "DocumentRef.SalesOrder" ) ) then
		fillBySalesOrder ();
	elsif ( baseType = Type ( "DocumentObject.Shipment" ) ) then
		fillByShipment ();
	endif;
	
EndProcedure

Procedure fillBySalesOrder ()
	
	setEnv ();
	sqlSalesOrder ();
	SQL.Perform ( Env );
	FillPropertyValues ( ThisObject, Env.Fields );
	Date = CurrentSessionDate ();
	Items.Load ( Env.Items );
	Services.Load ( Env.Services );
	adjustItems ();
	
EndProcedure

Procedure setEnv ()
	
	Env = new Structure ();
	SQL.Init ( Env );
	Env.Q.SetParameter ( "Base", Base );
	
EndProcedure

Procedure sqlSalesOrder ()
	
	s = "
	|// @Fields
	|select Documents.Amount as Amount, Documents.Company as Company, Documents.Contract as Contract,
	|	Documents.Creator as Creator, Documents.Currency as Currency,
	|	Documents.Customer as Customer, Documents.Discount as Discount, Documents.DeliveryDate as DeliveryDate,
	|	Documents.Factor as Factor, Documents.GrossAmount as GrossAmount,
	|	Documents.Prices as Prices, Documents.Rate as Rate, Documents.VATUse as VATUse, Documents.VAT as VAT,
	|	Documents.Warehouse as Warehouse, Documents.Ref as SalesOrder,
	|	Documents.Department as Department, Documents.Number as SO, Documents.PO as PO
	|from Document.SalesOrder as Documents
	|where Documents.Ref = &Base
	|;
	|// #Items
	|select Items.Feature as Feature, Items.DeliveryDate as DeliveryDate, Items.DiscountRate as DiscountRate, Items.Item as Item,
	|	Items.Package as PackagePlan, Items.Price as Price, Items.Prices as Prices, Items.Quantity as QuantityPlan,
	|	Items.QuantityPkg as QuantityPkgPlan, Items.Discount as Discount,
	|	Items.Capacity as CapacityPlan, Items.VAT as VAT, Items.VATCode as VATCode, Items.Total as Total,
	|	Items.VATRate as VATRate, Items.Amount as Amount, Items.Reservation as Reservation, Items.Stock as Stock,
	|	Items.RowKey as RowKey, Items.DocumentOrder as DocumentOrder, Items.DocumentOrderRowKey as DocumentOrderRowKey
	|from Document.SalesOrder.Items as Items
	|where Items.Ref = &Base
	|order by Items.LineNumber
	|;
	|// #Services
	|select Services.Feature as Feature, Services.DeliveryDate as DeliveryDate, Services.DiscountRate as DiscountRate,
	|	Services.Item as Item, Services.Discount as Discount, Services.VAT as VAT, Services.VATCode as VATCode, 
	|	Services.VATRate as VATRate, Services.Total as Total,
	|	Services.Amount as Amount, Services.Price as Price, Services.Prices as Prices,
	|	Services.Quantity as Quantity, Services.Description as Description, Services.RowKey as RowKey
	|from Document.SalesOrder.Services as Services
	|where Services.Ref = &Base
	|order by Services.LineNumber
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure adjustItems ()
	
	for each row in Items do
		row.Capacity = row.CapacityPlan;
		row.Package = row.PackagePlan;
		row.QuantityBack = row.QuantityPlan;
		row.QuantityPkgBack = row.QuantityPlan;
	enddo; 
	
EndProcedure 

Procedure fillByShipment ()
	
	headerByShipment ();
	itemsByShipment ();
	
EndProcedure 

Procedure headerByShipment ()
	
	FillPropertyValues ( ThisObject, Base );
	Number = "";
	Memo = "";
	Date = CurrentSessionDate ();
	
EndProcedure 

Procedure itemsByShipment ()
	
	for each row in Base.Items do
		if ( row.QuantityBack = 0 ) then
			continue;
		endif; 
		newRow = Items.Add ();
		FillPropertyValues ( newRow, row );
		newRow.Picked = false;
		newRow.QuantityPlan = newRow.QuantityBack;
		newRow.QuantityPkgPlan = newRow.QuantityPkgBack;
		newRow.Quantity = 0;
		newRow.QuantityPkg = 0;
	enddo; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	SetPrivilegedMode ( true );
	if ( not canChange () ) then
		Cancel = true;
		return;
	endif; 
	SetPrivilegedMode ( false );
	
EndProcedure

Function canChange ()
	
	if ( IsInRole ( "Administrator" ) ) then
		return true;
	endif; 
	status = InformationRegisters.ShipmentStatuses.Get ( new Structure ( "Document", Ref ) ).Status;
	if ( status = Enums.ShipmentPoints.Finish ) then
		Output.ShipmentCannotBeChanged ();
		return false;
	endif; 
	return true;
	
EndFunction 

#endif
